fio-wb/with_write_buffer.log
=== 测试开始于 Thu Feb 26 10:47:26 UTC 2026 ===
正在预填充数据 (2G)...
--- Running: pre_fill (RW=write, BS=128k, Jobs=1, QD=64, Size=2G, Time=) ---
pre_fill: (g=0): rw=write, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=64
fio-3.28
Starting 1 process

pre_fill: (groupid=0, jobs=1): err= 0: pid=1546: Thu Feb 26 10:47:29 2026
  write: IOPS=5885, BW=736MiB/s (771MB/s)(2048MiB/2784msec); 0 zone resets
    slat (usec): min=2, max=1110, avg=26.75, stdev=20.80
    clat (usec): min=63, max=42248, avg=10842.22, stdev=8517.89
     lat (usec): min=68, max=42256, avg=10869.11, stdev=8514.30
    clat percentiles (usec):
     | 50.0th=[ 8160], 90.0th=[22676], 95.0th=[32637], 99.0th=[37487],
     | 99.9th=[41157]
   bw (  KiB/s): min=737024, max=780800, per=99.64%, avg=750592.00, stdev=17279.53, samples=5
   iops        : min= 5758, max= 6100, avg=5864.00, stdev=135.00, samples=5
  lat (usec)   : 100=0.04%, 250=0.20%, 500=0.61%, 750=0.71%, 1000=0.63%
  lat (msec)   : 2=1.78%, 4=10.66%, 10=52.12%, 20=19.19%, 50=14.04%
  cpu          : usr=2.08%, sys=8.08%, ctx=22267, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.2%, >=64=99.6%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=0,16384,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=736MiB/s (771MB/s), 736MiB/s-736MiB/s (771MB/s-771MB/s), io=2048MiB (2147MB), run=2784-2784msec

Disk stats (read/write):
  nvme0n1: ios=48/15528, merge=0/0, ticks=1/168307, in_queue=168308, util=96.58%

=== 步骤 2: 写入量 vs Buffer 大小对比 ===
--- Running: vol_small_seq (RW=write, BS=128k, Jobs=1, QD=32, Size=16M, Time=) ---
vol_small_seq: (g=0): rw=write, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=32
fio-3.28
Starting 1 process

vol_small_seq: (groupid=0, jobs=1): err= 0: pid=1605: Thu Feb 26 10:47:29 2026
  write: IOPS=5818, BW=727MiB/s (763MB/s)(16.0MiB/22msec); 0 zone resets
    slat (nsec): min=3131, max=94723, avg=28654.95, stdev=18614.75
    clat (usec): min=630, max=13429, avg=5183.30, stdev=3541.90
     lat (usec): min=669, max=13460, avg=5212.06, stdev=3542.68
    clat percentiles (usec):
     | 50.0th=[ 4424], 90.0th=[11469], 95.0th=[12518], 99.0th=[13304],
     | 99.9th=[13435]
  lat (usec)   : 750=6.25%, 1000=5.47%
  lat (msec)   : 2=8.59%, 4=21.09%, 10=43.75%, 20=14.84%
  cpu          : usr=0.00%, sys=19.05%, ctx=199, majf=0, minf=11
  IO depths    : 1=0.8%, 2=1.6%, 4=3.1%, 8=6.2%, 16=12.5%, 32=75.8%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.0%, 8=0.0%, 16=0.0%, 32=1.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,128,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=727MiB/s (763MB/s), 727MiB/s-727MiB/s (763MB/s-763MB/s), io=16.0MiB (16.8MB), run=22-22msec

Disk stats (read/write):
  nvme0n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%

--- Running: vol_small_rand (RW=randwrite, BS=4k, Jobs=1, QD=32, Size=16M, Time=) ---
vol_small_rand: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.28
Starting 1 process

vol_small_rand: (groupid=0, jobs=1): err= 0: pid=1622: Thu Feb 26 10:47:30 2026
  write: IOPS=31.3k, BW=122MiB/s (128MB/s)(16.0MiB/131msec); 0 zone resets
    slat (nsec): min=624, max=278703, avg=29624.34, stdev=11833.72
    clat (usec): min=60, max=2476, avg=986.67, stdev=242.20
     lat (usec): min=96, max=2484, avg=1016.39, stdev=243.86
    clat percentiles (usec):
     | 50.0th=[  988], 90.0th=[ 1237], 95.0th=[ 1369], 99.0th=[ 1762],
     | 99.9th=[ 2343]
  lat (usec)   : 100=0.15%, 250=0.76%, 500=3.05%, 750=5.76%, 1000=46.48%
  lat (msec)   : 2=43.02%, 4=0.78%
  cpu          : usr=0.00%, sys=18.46%, ctx=3791, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.2%, 16=0.4%, 32=99.2%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,4096,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=122MiB/s (128MB/s), 122MiB/s-122MiB/s (128MB/s-128MB/s), io=16.0MiB (16.8MB), run=131-131msec

Disk stats (read/write):
  nvme0n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%

--- Running: vol_large_seq (RW=write, BS=128k, Jobs=1, QD=32, Size=512M, Time=) ---
vol_large_seq: (g=0): rw=write, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=32
fio-3.28
Starting 1 process

vol_large_seq: (groupid=0, jobs=1): err= 0: pid=1639: Thu Feb 26 10:47:31 2026
  write: IOPS=4708, BW=589MiB/s (617MB/s)(512MiB/870msec); 0 zone resets
    slat (usec): min=2, max=1016, avg=30.59, stdev=28.36
    clat (usec): min=76, max=19589, avg=6757.04, stdev=3327.90
     lat (usec): min=98, max=19628, avg=6787.80, stdev=3333.14
    clat percentiles (usec):
     | 50.0th=[ 6390], 90.0th=[11600], 95.0th=[12649], 99.0th=[14091],
     | 99.9th=[17957]
   bw (  KiB/s): min=610560, max=610560, per=100.00%, avg=610560.00, stdev= 0.00, samples=1
   iops        : min= 4770, max= 4770, avg=4770.00, stdev= 0.00, samples=1
  lat (usec)   : 100=0.05%, 250=0.56%, 500=1.20%, 750=1.12%, 1000=0.90%
  lat (msec)   : 2=2.98%, 4=14.72%, 10=61.57%, 20=16.89%
  cpu          : usr=0.69%, sys=7.25%, ctx=6751, majf=0, minf=11
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.2%, 16=0.4%, 32=99.2%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,4096,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=589MiB/s (617MB/s), 589MiB/s-589MiB/s (617MB/s-617MB/s), io=512MiB (537MB), run=870-870msec

Disk stats (read/write):
  nvme0n1: ios=50/3037, merge=0/0, ticks=1/20566, in_queue=20567, util=87.17%

--- Running: vol_large_rand (RW=randwrite, BS=4k, Jobs=1, QD=32, Size=512M, Time=) ---
vol_large_rand: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.28
Starting 1 process

vol_large_rand: (groupid=0, jobs=1): err= 0: pid=1656: Thu Feb 26 10:47:36 2026
  write: IOPS=29.0k, BW=113MiB/s (119MB/s)(512MiB/4521msec); 0 zone resets
    slat (nsec): min=558, max=1114.7k, avg=30614.03, stdev=15467.89
    clat (usec): min=24, max=6999, avg=1072.45, stdev=397.27
     lat (usec): min=35, max=7005, avg=1103.17, stdev=398.08
    clat percentiles (usec):
     | 50.0th=[  996], 90.0th=[ 1385], 95.0th=[ 1663], 99.0th=[ 2704],
     | 99.9th=[ 4817]
   bw (  KiB/s): min=111688, max=119424, per=100.00%, avg=116040.00, stdev=2587.37, samples=9
   iops        : min=27922, max=29856, avg=29010.00, stdev=646.84, samples=9
  lat (usec)   : 50=0.01%, 100=0.19%, 250=0.60%, 500=1.64%, 750=3.23%
  lat (usec)   : 1000=45.34%
  lat (msec)   : 2=46.28%, 4=2.38%, 10=0.33%
  cpu          : usr=1.04%, sys=18.69%, ctx=125660, majf=0, minf=11
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,131072,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=113MiB/s (119MB/s), 113MiB/s-113MiB/s (119MB/s-119MB/s), io=512MiB (537MB), run=4521-4521msec

Disk stats (read/write):
  nvme0n1: ios=50/127477, merge=0/0, ticks=2/99798, in_queue=99800, util=98.06%

=== 步骤 3: 不同读写模式/块大小/线程数矩阵 ===
--- Running: bs_4k (RW=randwrite, BS=4k, Jobs=1, QD=32, Size=2G, Time=30) ---
bs_4k: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.28
Starting 1 process

bs_4k: (groupid=0, jobs=1): err= 0: pid=1715: Thu Feb 26 10:48:06 2026
  write: IOPS=28.7k, BW=112MiB/s (118MB/s)(3363MiB/30002msec); 0 zone resets
    slat (nsec): min=569, max=1962.7k, avg=30487.38, stdev=15946.98
    clat (usec): min=19, max=9667, avg=1084.11, stdev=457.99
     lat (usec): min=45, max=9749, avg=1114.70, stdev=458.60
    clat percentiles (usec):
     | 50.0th=[  996], 90.0th=[ 1401], 95.0th=[ 1713], 99.0th=[ 3130],
     | 99.9th=[ 5342]
   bw (  KiB/s): min=102776, max=121760, per=100.00%, avg=114827.25, stdev=3916.48, samples=59
   iops        : min=25694, max=30440, avg=28706.81, stdev=979.12, samples=59
  lat (usec)   : 20=0.01%, 50=0.01%, 100=0.23%, 250=0.82%, 500=1.84%
  lat (usec)   : 750=3.24%, 1000=45.70%
  lat (msec)   : 2=44.70%, 4=3.06%, 10=0.41%
  cpu          : usr=0.95%, sys=18.35%, ctx=823202, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,860903,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=112MiB/s (118MB/s), 112MiB/s-112MiB/s (118MB/s-118MB/s), io=3363MiB (3526MB), run=30002-30002msec

Disk stats (read/write):
  nvme0n1: ios=50/857847, merge=0/0, ticks=2/689074, in_queue=689077, util=99.80%

--- Running: bs_16k (RW=randwrite, BS=16k, Jobs=1, QD=32, Size=2G, Time=30) ---
bs_16k: (g=0): rw=randwrite, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=libaio, iodepth=32
fio-3.28
Starting 1 process

bs_16k: (groupid=0, jobs=1): err= 0: pid=1772: Thu Feb 26 10:48:36 2026
  write: IOPS=19.5k, BW=305MiB/s (320MB/s)(9162MiB/30002msec); 0 zone resets
    slat (nsec): min=903, max=1413.9k, avg=14212.32, stdev=17822.26
    clat (usec): min=12, max=14575, avg=1622.41, stdev=1020.08
     lat (usec): min=35, max=14614, avg=1636.72, stdev=1017.63
    clat percentiles (usec):
     | 50.0th=[ 1450], 90.0th=[ 2114], 95.0th=[ 2540], 99.0th=[ 7767],
     | 99.9th=[10028]
   bw (  KiB/s): min=283264, max=343328, per=100.00%, avg=313280.34, stdev=12840.21, samples=59
   iops        : min=17704, max=21458, avg=19580.02, stdev=802.51, samples=59
  lat (usec)   : 20=0.01%, 50=0.03%, 100=0.22%, 250=0.84%, 500=1.23%
  lat (usec)   : 750=1.28%, 1000=4.14%
  lat (msec)   : 2=79.75%, 4=10.06%, 10=2.35%, 20=0.10%
  cpu          : usr=1.62%, sys=12.24%, ctx=613088, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,586354,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=305MiB/s (320MB/s), 305MiB/s-305MiB/s (320MB/s-320MB/s), io=9162MiB (9607MB), run=30002-30002msec

Disk stats (read/write):
  nvme0n1: ios=51/584545, merge=0/0, ticks=3/931093, in_queue=931097, util=99.78%

--- Running: bs_128k (RW=randwrite, BS=128k, Jobs=1, QD=32, Size=2G, Time=30) ---
bs_128k: (g=0): rw=randwrite, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=32
fio-3.28
Starting 1 process

bs_128k: (groupid=0, jobs=1): err= 0: pid=1868: Thu Feb 26 10:49:06 2026
  write: IOPS=4297, BW=537MiB/s (563MB/s)(15.7GiB/30005msec); 0 zone resets
    slat (usec): min=2, max=1555, avg=31.26, stdev=19.75
    clat (usec): min=59, max=25889, avg=7413.18, stdev=3520.77
     lat (usec): min=79, max=25937, avg=7444.57, stdev=3524.23
    clat percentiles (usec):
     | 50.0th=[ 7111], 90.0th=[12256], 95.0th=[14091], 99.0th=[16188],
     | 99.9th=[19530]
   bw (  KiB/s): min=507904, max=589568, per=100.00%, avg=550842.58, stdev=19588.13, samples=59
   iops        : min= 3968, max= 4606, avg=4303.46, stdev=153.03, samples=59
  lat (usec)   : 100=0.03%, 250=0.34%, 500=0.89%, 750=0.80%, 1000=0.62%
  lat (msec)   : 2=1.86%, 4=11.98%, 10=62.79%, 20=20.61%, 50=0.08%
  cpu          : usr=1.15%, sys=6.04%, ctx=220861, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,128946,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=537MiB/s (563MB/s), 537MiB/s-537MiB/s (563MB/s-563MB/s), io=15.7GiB (16.9GB), run=30005-30005msec

Disk stats (read/write):
  nvme0n1: ios=50/128466, merge=0/0, ticks=8/953643, in_queue=953651, util=99.81%

--- Running: bs_1M (RW=randwrite, BS=1M, Jobs=1, QD=32, Size=2G, Time=30) ---
bs_1M: (g=0): rw=randwrite, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=32
fio-3.28
Starting 1 process

bs_1M: (groupid=0, jobs=1): err= 0: pid=1964: Thu Feb 26 10:49:37 2026
  write: IOPS=700, BW=700MiB/s (734MB/s)(20.8GiB/30401msec); 0 zone resets
    slat (usec): min=11, max=820, avg=63.65, stdev=45.10
    clat (usec): min=441, max=817991, avg=45619.90, stdev=87033.08
     lat (usec): min=490, max=818016, avg=45683.80, stdev=87035.76
    clat percentiles (msec):
     | 50.0th=[    8], 90.0th=[  186], 95.0th=[  230], 99.0th=[  363],
     | 99.9th=[  510]
   bw (  KiB/s): min=573440, max=815104, per=100.00%, avg=725410.78, stdev=46646.36, samples=60
   iops        : min=  560, max=  796, avg=708.40, stdev=45.55, samples=60
  lat (usec)   : 500=0.01%, 750=0.09%, 1000=0.15%
  lat (msec)   : 2=1.40%, 4=14.21%, 10=54.21%, 20=10.71%, 50=0.05%
  lat (msec)   : 100=0.59%, 250=14.94%, 500=3.54%, 750=0.07%, 1000=0.03%
  cpu          : usr=2.83%, sys=2.44%, ctx=20460, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=99.9%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,21284,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=700MiB/s (734MB/s), 700MiB/s-700MiB/s (734MB/s-734MB/s), io=20.8GiB (22.3GB), run=30401-30401msec

Disk stats (read/write):
  nvme0n1: ios=50/26808, merge=0/0, ticks=16/1026668, in_queue=1026684, util=99.70%

--- Running: jobs_1 (RW=randwrite, BS=4k, Jobs=1, QD=1, Size=2G, Time=30) ---
jobs_1: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
fio-3.28
Starting 1 process

jobs_1: (groupid=0, jobs=1): err= 0: pid=2060: Thu Feb 26 10:50:07 2026
  write: IOPS=16.9k, BW=66.1MiB/s (69.3MB/s)(1984MiB/30001msec); 0 zone resets
    slat (nsec): min=1616, max=1044.5k, avg=13521.99, stdev=8671.30
    clat (nsec): min=245, max=12027k, avg=45028.07, stdev=94256.24
     lat (usec): min=16, max=12035, avg=58.63, stdev=95.05
    clat percentiles (usec):
     | 50.0th=[   40], 90.0th=[   53], 95.0th=[   59], 99.0th=[  141],
     | 99.9th=[  627]
   bw (  KiB/s): min=59712, max=77336, per=100.00%, avg=67868.24, stdev=3746.27, samples=59
   iops        : min=14928, max=19334, avg=16967.03, stdev=936.58, samples=59
  lat (nsec)   : 250=0.01%, 500=0.03%, 750=0.01%, 1000=0.01%
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.08%, 20=0.17%, 50=86.36%
  lat (usec)   : 100=11.90%, 250=0.93%, 500=0.38%, 750=0.05%, 1000=0.01%
  lat (msec)   : 2=0.03%, 4=0.02%, 10=0.01%, 20=0.01%
  cpu          : usr=2.45%, sys=29.83%, ctx=509323, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,507836,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=66.1MiB/s (69.3MB/s), 66.1MiB/s-66.1MiB/s (69.3MB/s-69.3MB/s), io=1984MiB (2080MB), run=30001-30001msec

Disk stats (read/write):
  nvme0n1: ios=51/506179, merge=0/0, ticks=0/26261, in_queue=26262, util=99.81%

--- Running: jobs_2 (RW=randwrite, BS=4k, Jobs=2, QD=1, Size=2G, Time=30) ---
jobs_2: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
...
fio-3.28
Starting 2 processes

jobs_2: (groupid=0, jobs=2): err= 0: pid=2177: Thu Feb 26 10:50:37 2026
  write: IOPS=30.7k, BW=120MiB/s (126MB/s)(3603MiB/30001msec); 0 zone resets
    slat (nsec): min=1071, max=1335.4k, avg=13001.21, stdev=9909.15
    clat (nsec): min=234, max=14060k, avg=51522.86, stdev=126856.80
     lat (usec): min=17, max=14066, avg=64.61, stdev=127.37
    clat percentiles (usec):
     | 50.0th=[   44], 90.0th=[   62], 95.0th=[   71], 99.0th=[  161],
     | 99.9th=[ 1778]
   bw (  KiB/s): min=112736, max=134264, per=100.00%, avg=123100.20, stdev=2277.07, samples=118
   iops        : min=28184, max=33566, avg=30775.05, stdev=569.27, samples=118
  lat (nsec)   : 250=0.01%, 500=0.05%, 750=0.01%, 1000=0.01%
  lat (usec)   : 2=0.06%, 4=0.01%, 10=0.08%, 20=0.19%, 50=67.82%
  lat (usec)   : 100=29.95%, 250=1.24%, 500=0.38%, 750=0.05%, 1000=0.02%
  lat (msec)   : 2=0.06%, 4=0.06%, 10=0.03%, 20=0.01%
  cpu          : usr=2.17%, sys=25.64%, ctx=926649, majf=0, minf=29
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,922346,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=120MiB/s (126MB/s), 120MiB/s-120MiB/s (126MB/s-126MB/s), io=3603MiB (3778MB), run=30001-30001msec

Disk stats (read/write):
  nvme0n1: ios=50/919192, merge=0/0, ticks=3/53282, in_queue=53285, util=99.78%

--- Running: jobs_4 (RW=randwrite, BS=4k, Jobs=4, QD=1, Size=2G, Time=30) ---
jobs_4: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
...
fio-3.28
Starting 4 processes

jobs_4: (groupid=0, jobs=4): err= 0: pid=2280: Thu Feb 26 10:51:08 2026
  write: IOPS=28.3k, BW=111MiB/s (116MB/s)(3320MiB/30001msec); 0 zone resets
    slat (nsec): min=822, max=3366.3k, avg=10462.57, stdev=13924.95
    clat (nsec): min=217, max=38214k, avg=129908.74, stdev=400734.23
     lat (usec): min=17, max=38215, avg=140.47, stdev=400.52
    clat percentiles (usec):
     | 50.0th=[  106], 90.0th=[  202], 95.0th=[  233], 99.0th=[  383],
     | 99.9th=[  799]
   bw (  KiB/s): min=79088, max=145160, per=100.00%, avg=113480.14, stdev=4328.21, samples=236
   iops        : min=19772, max=36290, avg=28370.03, stdev=1082.05, samples=236
  lat (nsec)   : 250=0.01%, 500=0.12%, 750=0.01%, 1000=0.01%
  lat (usec)   : 2=0.03%, 4=0.01%, 10=0.02%, 20=0.40%, 50=9.75%
  lat (usec)   : 100=36.18%, 250=49.78%, 500=3.29%, 750=0.29%, 1000=0.04%
  lat (msec)   : 2=0.02%, 4=0.01%, 10=0.01%, 20=0.04%, 50=0.01%
  cpu          : usr=1.23%, sys=7.44%, ctx=959966, majf=1, minf=67
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,849824,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=111MiB/s (116MB/s), 111MiB/s-111MiB/s (116MB/s-116MB/s), io=3320MiB (3481MB), run=30001-30001msec

Disk stats (read/write):
  nvme0n1: ios=50/847665, merge=0/0, ticks=5/107815, in_queue=107820, util=99.78%

--- Running: mode_write (RW=write, BS=4k, Jobs=1, QD=32, Size=2G, Time=30) ---
mode_write: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.28
Starting 1 process

mode_write: (groupid=0, jobs=1): err= 0: pid=2397: Thu Feb 26 10:51:38 2026
  write: IOPS=28.8k, BW=113MiB/s (118MB/s)(3377MiB/30001msec); 0 zone resets
    slat (nsec): min=544, max=1848.0k, avg=30959.58, stdev=15461.93
    clat (usec): min=22, max=9854, avg=1079.19, stdev=441.02
     lat (usec): min=41, max=9861, avg=1110.24, stdev=441.73
    clat percentiles (usec):
     | 50.0th=[ 1045], 90.0th=[ 1369], 95.0th=[ 1598], 99.0th=[ 2671],
     | 99.9th=[ 6325]
   bw (  KiB/s): min=109608, max=121112, per=100.00%, avg=115293.17, stdev=2685.33, samples=59
   iops        : min=27402, max=30278, avg=28823.29, stdev=671.33, samples=59
  lat (usec)   : 50=0.01%, 100=0.22%, 250=0.87%, 500=2.12%, 750=3.58%
  lat (usec)   : 1000=33.53%
  lat (msec)   : 2=57.43%, 4=1.83%, 10=0.40%
  cpu          : usr=0.79%, sys=19.04%, ctx=820343, majf=0, minf=13
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,864439,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=113MiB/s (118MB/s), 113MiB/s-113MiB/s (118MB/s-118MB/s), io=3377MiB (3541MB), run=30001-30001msec

Disk stats (read/write):
  nvme0n1: ios=50/861457, merge=0/0, ticks=45/677842, in_queue=677887, util=99.93%

--- Running: mode_randwrite (RW=randwrite, BS=4k, Jobs=1, QD=32, Size=2G, Time=30) ---
mode_randwrite: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.28
Starting 1 process

mode_randwrite: (groupid=0, jobs=1): err= 0: pid=2496: Thu Feb 26 10:52:08 2026
  write: IOPS=27.7k, BW=108MiB/s (114MB/s)(3248MiB/30001msec); 0 zone resets
    slat (nsec): min=546, max=1653.3k, avg=31074.29, stdev=16038.88
    clat (nsec): min=588, max=12522k, avg=1122957.03, stdev=546550.33
     lat (usec): min=42, max=12529, avg=1154.14, stdev=546.95
    clat percentiles (usec):
     | 50.0th=[ 1045], 90.0th=[ 1434], 95.0th=[ 1795], 99.0th=[ 3458],
     | 99.9th=[ 7111]
   bw (  KiB/s): min=102488, max=117664, per=100.00%, avg=110899.03, stdev=3036.69, samples=59
   iops        : min=25622, max=29416, avg=27724.75, stdev=759.17, samples=59
  lat (nsec)   : 750=0.01%
  lat (usec)   : 2=0.01%, 20=0.01%, 50=0.01%, 100=0.24%, 250=0.92%
  lat (usec)   : 500=1.90%, 750=3.30%, 1000=30.54%
  lat (msec)   : 2=59.20%, 4=3.23%, 10=0.63%, 20=0.02%
  cpu          : usr=0.85%, sys=18.57%, ctx=790684, majf=0, minf=13
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,831493,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=108MiB/s (114MB/s), 108MiB/s-108MiB/s (114MB/s-114MB/s), io=3248MiB (3406MB), run=30001-30001msec

Disk stats (read/write):
  nvme0n1: ios=50/828542, merge=0/0, ticks=2/705829, in_queue=705831, util=99.79%

--- Running: mode_rw (RW=rw, BS=4k, Jobs=1, QD=32, Size=2G, Time=30) ---
mode_rw: (g=0): rw=rw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.28
Starting 1 process
fio: pid=2593, err=5/file:io_u.c:1845, func=io_u error, error=Input/output error

mode_rw: (groupid=0, jobs=1): err= 5 (file:io_u.c:1845, func=io_u error, error=Input/output error): pid=2593: Thu Feb 26 10:52:08 2026
  read: IOPS=1666, BW=6500KiB/s (6656kB/s)(156KiB/24msec)
    slat (nsec): min=687, max=80711, avg=18377.82, stdev=16175.78
    clat (usec): min=48, max=969, avg=462.35, stdev=317.78
     lat (usec): min=58, max=1052, avg=481.14, stdev=323.17
    clat percentiles (usec):
     | 50.0th=[  363], 90.0th=[  840], 95.0th=[  873], 99.0th=[  971],
     | 99.9th=[  971]
  write: IOPS=2000, BW=2833KiB/s (2901kB/s)(68.0KiB/24msec); 0 zone resets
    slat (nsec): min=619, max=64034, avg=23545.08, stdev=18211.34
    clat (usec): min=686, max=996, avg=842.78, stdev=78.95
     lat (usec): min=721, max=1004, avg=874.68, stdev=79.52
    clat percentiles (usec):
     | 50.0th=[  848], 90.0th=[  938], 95.0th=[  996], 99.0th=[  996],
     | 99.9th=[  996]
  lat (usec)   : 50=2.27%, 100=4.55%, 250=10.23%, 500=9.09%, 750=5.68%
  lat (usec)   : 1000=31.82%
  cpu          : usr=8.70%, sys=0.00%, ctx=51, majf=0, minf=21
  IO depths    : 1=1.1%, 2=2.3%, 4=4.5%, 8=9.1%, 16=18.2%, 32=64.8%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=1.7%, 4=96.6%, 8=0.0%, 16=0.0%, 32=1.7%, 64=0.0%, >=64=0.0%
     issued rwts: total=40,48,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=6500KiB/s (6656kB/s), 6500KiB/s-6500KiB/s (6656kB/s-6656kB/s), io=156KiB (160kB), run=24-24msec
  WRITE: bw=2833KiB/s (2901kB/s), 2833KiB/s-2833KiB/s (2901kB/s-2901kB/s), io=68.0KiB (69.6kB), run=24-24msec

Disk stats (read/write):
  nvme0n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%

--- Running: mode_randrw (RW=randrw, BS=4k, Jobs=1, QD=32, Size=2G, Time=30) ---
mode_randrw: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.28
Starting 1 process
fio: pid=2610, err=5/file:io_u.c:1845, func=io_u error, error=Input/output error

mode_randrw: (groupid=0, jobs=1): err= 5 (file:io_u.c:1845, func=io_u error, error=Input/output error): pid=2610: Thu Feb 26 10:52:09 2026
  read: IOPS=20.7k, BW=80.7MiB/s (84.7MB/s)(5952KiB/72msec)
    slat (nsec): min=604, max=213386, avg=16509.19, stdev=13917.93
    clat (usec): min=80, max=3288, avg=708.10, stdev=263.88
     lat (usec): min=90, max=3295, avg=724.70, stdev=264.40
    clat percentiles (usec):
     | 50.0th=[  709], 90.0th=[  873], 95.0th=[  979], 99.0th=[ 2343],
     | 99.9th=[ 3032]
  write: IOPS=21.8k, BW=83.9MiB/s (87.9MB/s)(6184KiB/72msec); 0 zone resets
    slat (nsec): min=638, max=236834, avg=25965.21, stdev=19329.02
    clat (usec): min=73, max=1878, avg=735.88, stdev=246.99
     lat (usec): min=86, max=1878, avg=761.48, stdev=246.78
    clat percentiles (usec):
     | 50.0th=[  676], 90.0th=[ 1029], 95.0th=[ 1156], 99.0th=[ 1713],
     | 99.9th=[ 1860]
  lat (usec)   : 100=0.07%, 250=0.95%, 500=9.04%, 750=55.63%, 1000=25.90%
  lat (msec)   : 2=7.24%, 4=0.52%
  cpu          : usr=1.41%, sys=33.80%, ctx=1521, majf=0, minf=20
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.3%, 16=0.5%, 32=99.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=1488,1566,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=80.7MiB/s (84.7MB/s), 80.7MiB/s-80.7MiB/s (84.7MB/s-84.7MB/s), io=5952KiB (6095kB), run=72-72msec
  WRITE: bw=83.9MiB/s (87.9MB/s), 83.9MiB/s-83.9MiB/s (87.9MB/s-87.9MB/s), io=6184KiB (6332kB), run=72-72msec

Disk stats (read/write):
  nvme0n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%

=== 步骤 4: 写入 QD 扫描测试 ===
--- Running: qd_scan_1 (RW=randwrite, BS=4k, Jobs=1, QD=1, Size=2G, Time=10) ---
qd_scan_1: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
fio-3.28
Starting 1 process
fio: pid=2629, err=5/file:io_u.c:1845, func=io_u error, error=Input/output error

qd_scan_1: (groupid=0, jobs=1): err= 5 (file:io_u.c:1845, func=io_u error, error=Input/output error): pid=2629: Thu Feb 26 10:52:09 2026
  write: IOPS=17.4k, BW=67.8MiB/s (71.1MB/s)(972KiB/14msec); 0 zone resets
    slat (usec): min=9, max=120, avg=13.50, stdev= 8.17
    clat (usec): min=27, max=258, avg=39.17, stdev=26.04
     lat (usec): min=40, max=271, avg=52.63, stdev=27.78
    clat percentiles (usec):
     | 50.0th=[   35], 90.0th=[   38], 95.0th=[   45], 99.0th=[  194],
     | 99.9th=[  260]
  lat (usec)   : 50=95.08%, 100=1.64%, 250=2.46%, 500=0.41%
  cpu          : usr=30.77%, sys=0.00%, ctx=244, majf=0, minf=18
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.4%, 4=99.6%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,244,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=67.8MiB/s (71.1MB/s), 67.8MiB/s-67.8MiB/s (71.1MB/s-71.1MB/s), io=972KiB (995kB), run=14-14msec

Disk stats (read/write):
  nvme0n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%

--- Running: qd_scan_2 (RW=randwrite, BS=4k, Jobs=1, QD=2, Size=2G, Time=10) ---
qd_scan_2: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
fio-3.28
Starting 1 process
fio: pid=2646, err=5/file:io_u.c:1845, func=io_u error, error=Input/output error

qd_scan_2: (groupid=0, jobs=1): err= 5 (file:io_u.c:1845, func=io_u error, error=Input/output error): pid=2646: Thu Feb 26 10:52:09 2026
  write: IOPS=23.4k, BW=91.6MiB/s (96.0MB/s)(18.6MiB/203msec); 0 zone resets
    slat (nsec): min=1034, max=649412, avg=24688.67, stdev=18463.48
    clat (usec): min=10, max=9254, avg=59.62, stdev=191.58
     lat (usec): min=42, max=9262, avg=84.39, stdev=192.36
    clat percentiles (usec):
     | 50.0th=[   51], 90.0th=[   75], 95.0th=[   87], 99.0th=[  235],
     | 99.9th=[  529]
  lat (usec)   : 20=0.44%, 50=45.74%, 100=50.67%, 250=2.14%, 500=0.78%
  lat (usec)   : 750=0.13%, 1000=0.02%
  lat (msec)   : 10=0.04%
  cpu          : usr=0.50%, sys=21.78%, ctx=5337, majf=0, minf=20
  IO depths    : 1=0.1%, 2=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,4760,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=2

Run status group 0 (all jobs):
  WRITE: bw=91.6MiB/s (96.0MB/s), 91.6MiB/s-91.6MiB/s (96.0MB/s-96.0MB/s), io=18.6MiB (19.5MB), run=203-203msec

Disk stats (read/write):
  nvme0n1: ios=50/3631, merge=0/0, ticks=1/241, in_queue=241, util=62.40%

--- Running: qd_scan_4 (RW=randwrite, BS=4k, Jobs=1, QD=4, Size=2G, Time=10) ---
qd_scan_4: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=4
fio-3.28
Starting 1 process
fio: pid=2681, err=5/file:io_u.c:1845, func=io_u error, error=Input/output error

qd_scan_4: (groupid=0, jobs=1): err= 5 (file:io_u.c:1845, func=io_u error, error=Input/output error): pid=2681: Thu Feb 26 10:52:10 2026
  cpu          : usr=0.00%, sys=0.00%, ctx=2, majf=0, minf=16
  IO depths    : 1=25.0%, 2=50.0%, 4=25.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,4,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):

Disk stats (read/write):
  nvme0n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%

--- Running: qd_scan_8 (RW=randwrite, BS=4k, Jobs=1, QD=8, Size=2G, Time=10) ---
qd_scan_8: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=8
fio-3.28
Starting 1 process
fio: pid=2698, err=5/file:io_u.c:1845, func=io_u error, error=Input/output error

qd_scan_8: (groupid=0, jobs=1): err= 5 (file:io_u.c:1845, func=io_u error, error=Input/output error): pid=2698: Thu Feb 26 10:52:10 2026
  write: IOPS=27.4k, BW=104MiB/s (109MB/s)(1172KiB/11msec); 0 zone resets
    slat (nsec): min=654, max=250018, avg=31113.90, stdev=16005.16
    clat (usec): min=103, max=593, avg=234.16, stdev=54.17
     lat (usec): min=137, max=628, avg=265.28, stdev=57.52
    clat percentiles (usec):
     | 50.0th=[  217], 90.0th=[  273], 95.0th=[  359], 99.0th=[  457],
     | 99.9th=[  594]
  lat (usec)   : 250=78.41%, 500=18.27%, 750=0.66%
  cpu          : usr=0.00%, sys=20.00%, ctx=295, majf=0, minf=20
  IO depths    : 1=0.3%, 2=0.7%, 4=1.3%, 8=97.7%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.7%, 8=0.3%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,301,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
  WRITE: bw=104MiB/s (109MB/s), 104MiB/s-104MiB/s (109MB/s-109MB/s), io=1172KiB (1200kB), run=11-11msec

Disk stats (read/write):
  nvme0n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%

--- Running: qd_scan_16 (RW=randwrite, BS=4k, Jobs=1, QD=16, Size=2G, Time=10) ---
qd_scan_16: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
fio-3.28
Starting 1 process
fio: pid=2715, err=5/file:io_u.c:1845, func=io_u error, error=Input/output error

qd_scan_16: (groupid=0, jobs=1): err= 5 (file:io_u.c:1845, func=io_u error, error=Input/output error): pid=2715: Thu Feb 26 10:52:10 2026
  cpu          : usr=0.00%, sys=0.00%, ctx=15, majf=0, minf=14
  IO depths    : 1=6.2%, 2=12.5%, 4=25.0%, 8=50.0%, 16=6.2%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=66.7%, 8=0.0%, 16=33.3%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,16,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):

Disk stats (read/write):
  nvme0n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%

--- Running: qd_scan_32 (RW=randwrite, BS=4k, Jobs=1, QD=32, Size=2G, Time=10) ---
qd_scan_32: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.28
Starting 1 process
fio: pid=2747, err=5/file:io_u.c:1845, func=io_u error, error=Input/output error

qd_scan_32: (groupid=0, jobs=1): err= 5 (file:io_u.c:1845, func=io_u error, error=Input/output error): pid=2747: Thu Feb 26 10:52:10 2026
  write: IOPS=28.3k, BW=110MiB/s (115MB/s)(5164KiB/46msec); 0 zone resets
    slat (nsec): min=632, max=354747, avg=31789.56, stdev=22423.39
    clat (usec): min=100, max=3060, avg=1077.15, stdev=293.97
     lat (usec): min=143, max=3060, avg=1108.74, stdev=291.35
    clat percentiles (usec):
     | 50.0th=[ 1020], 90.0th=[ 1336], 95.0th=[ 1549], 99.0th=[ 2409],
     | 99.9th=[ 2999]
  lat (usec)   : 250=0.69%, 500=1.31%, 750=1.15%, 1000=40.02%
  lat (msec)   : 2=54.07%, 4=1.92%
  cpu          : usr=0.00%, sys=22.22%, ctx=1212, majf=0, minf=19
  IO depths    : 1=0.1%, 2=0.2%, 4=0.3%, 8=0.6%, 16=1.2%, 32=97.6%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1302,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=110MiB/s (115MB/s), 110MiB/s-110MiB/s (115MB/s-115MB/s), io=5164KiB (5288kB), run=46-46msec

Disk stats (read/write):
  nvme0n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%

--- Running: qd_scan_64 (RW=randwrite, BS=4k, Jobs=1, QD=64, Size=2G, Time=10) ---
qd_scan_64: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
fio-3.28
Starting 1 process
fio: pid=2764, err=5/file:io_u.c:1845, func=io_u error, error=Input/output error

qd_scan_64: (groupid=0, jobs=1): err= 5 (file:io_u.c:1845, func=io_u error, error=Input/output error): pid=2764: Thu Feb 26 10:52:11 2026
  write: IOPS=26.9k, BW=105MiB/s (110MB/s)(15.8MiB/150msec); 0 zone resets
    slat (nsec): min=622, max=337003, avg=28904.09, stdev=15286.03
    clat (usec): min=71, max=19885, avg=2327.03, stdev=2268.03
     lat (usec): min=93, max=19914, avg=2356.02, stdev=2268.40
    clat percentiles (usec):
     | 50.0th=[ 1958], 90.0th=[ 2704], 95.0th=[ 3228], 99.0th=[18744],
     | 99.9th=[19792]
  lat (usec)   : 100=0.12%, 250=0.50%, 500=0.37%, 750=2.10%, 1000=1.81%
  lat (msec)   : 2=54.52%, 4=37.44%, 10=1.58%, 20=1.54%
  cpu          : usr=0.67%, sys=16.11%, ctx=3756, majf=0, minf=19
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.2%, 16=0.4%, 32=0.8%, >=64=98.4%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=0,4039,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=105MiB/s (110MB/s), 105MiB/s-105MiB/s (110MB/s-110MB/s), io=15.8MiB (16.5MB), run=150-150msec

Disk stats (read/write):
  nvme0n1: ios=51/4032, merge=0/0, ticks=3/5237, in_queue=5241, util=59.44%

=== 测试完成于 Thu Feb 26 10:52:11 UTC 2026 ===
所有结果已保存到：/root/exp_results/wb_test_20260226_104726.log